app/controllers/urls_controller.rb

  def update
    url = current_user.shortened_urls.where(id: params[:id]).first

    respond_to do |format|
      if url.update(url_update_params)
---
UPDATE `shortened_urls` SET `url` = 'https://stackoverflow.com/questions/4443477/rails-3-migration-with-longtextt', `updated_at` = '2017-09-19 07:26:36' WHERE `shortened_urls`.`id` = 5

  def destroy
    url = current_user.shortened_urls.where(id: params[:id]).first
    Shortener::ShortenedUrl.destroy(url.id)
---
SELECT  `shortened_urls`.* FROM `shortened_urls` WHERE `shortened_urls`.`id` = 6 LIMIT 1
DELETE FROM `shortened_urls` WHERE `shortened_urls`.`id` = 6